[
    {
        "completeCollection": false,
        "manga": {
            "themes": [
                {
                    "theme": "Showbiz",
                    "id": "7F64CF82-6EE6-4F14-9DE2-FD6322B9798E"
                },
                {
                    "theme": "Music",
                    "id": "2BA6A0CA-AB07-480F-942D-68061E786565"
                }
            ],
            "volumes": 7,
            "id": 8,
            "titleEnglish": "Full Moon wo Sagashite",
            "sypnosis": "At the tender age of twelve, Mitsuki Kouyama has a sarcoma in her throat. Though this rare cancer can be cured by removing her vocal cords, Mitsuki refuses because of her desire to become a pop singer and keep her childhood promise to Eichi Sakurai, her first love who left for America. Unable to both heal and keep her voice, she allows her health to deteriorate as she accepts her tragic fate.\n\nOne day, while escaping the home of her music-hating grandmother to attend an audition, Mitsuki meets two shinigami Takuto Kira and Meroko Yui. Realizing that Mitsuki can see them, Takuto and Meroko reveal to her that she will die in a year. Moved by her plight, Takuto allows Mitsuki the chance to pursue her dream by giving her the ability to transform into a healthy sixteen-year-old girl. After being chosen for a contract with Seed Records, Mitsuki makes her debut under the stage name Full Moon and chooses to pursue her dream music career before her life's end.\n\n[Written by MAL Rewrite]\n\n\nIncluded one-shot:\nVolume 2: Ginyuu Meika",
            "title": "Full Moon wo Sagashite",
            "titleJapanese": "満月〈フルムーン〉をさがして",
            "demographics": [
                {
                    "id": "C217B404-7691-4090-9775-9E63375EBF5B",
                    "demographic": "Shoujo"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/3/175970l.jpg\"",
            "score": 8.04,
            "chapters": 35,
            "startDate": "2001-12-01T00:00:00Z",
            "authors": [
                {
                    "lastName": "Tanemura",
                    "role": "Story & Art",
                    "id": "DC4661A0-C3B1-4975-8A60-5F3D7059140C",
                    "firstName": "Arina"
                }
            ],
            "endDate": "2004-04-30T00:00:00Z",
            "genres": [
                {
                    "id": "F974BCB6-B002-44A6-A224-90D1E50595A2",
                    "genre": "Comedy"
                },
                {
                    "id": "4312867C-1359-494A-AC46-BADFD2E1D4CD",
                    "genre": "Drama"
                },
                {
                    "id": "B3E8D4B2-7EE4-49CD-8DB0-9897619B3F62",
                    "genre": "Fantasy"
                },
                {
                    "id": "D8E1E0A9-DDC2-4520-BED7-745DD8DAD076",
                    "genre": "Romance"
                },
                {
                    "id": "AE80120B-6659-4C0E-AEB2-227EC25EC4AF",
                    "genre": "Supernatural"
                }
            ],
            "status": "finished",
            "url": "\"https://myanimelist.net/manga/8/Full_Moon_wo_Sagashite\"",
            "background": "Full Moon wo Sagashite was published in English by VIZ Media under the Shojo Beat imprint from July 5, 2005 to October 3, 2006; and in Spanish by Glénat from October 2006 to April 2007."
        },
        "volumesOwned": [
            2,
            1
        ],
        "id": "AA2102A8-A4F4-437C-8B62-6341F1BB8B5D",
        "readingVolume": 2,
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        }
    },
    {
        "completeCollection": false,
        "volumesOwned": [
            1
        ],
        "id": "D804EDE7-6C0B-4AE8-BD25-02E3DF565DC4",
        "manga": {
            "themes": [
                {
                    "theme": "Psychological",
                    "id": "4394C99F-615B-494A-929E-356A342A95B8"
                },
                {
                    "theme": "Super Power",
                    "id": "472FB2AE-13C0-4EEE-9A45-A7B75AC5DC29"
                }
            ],
            "authors": [
                {
                    "lastName": "CLAMP",
                    "role": "Story & Art",
                    "id": "425F1E1E-5163-48D6-8F39-C56BDE69ED99",
                    "firstName": ""
                }
            ],
            "volumes": 18,
            "demographics": [
                {
                    "id": "C217B404-7691-4090-9775-9E63375EBF5B",
                    "demographic": "Shoujo"
                }
            ],
            "score": 8.1,
            "startDate": "1992-03-24T00:00:00Z",
            "titleEnglish": "X",
            "chapters": 158,
            "status": "on_hiatus",
            "sypnosis": "Six years ago, Kamui Shirou and siblings Fuuma and Kotori Monou were inseparable childhood friends. After the sudden, gruesome death of the Monou siblings' mother, Kamui was taken away from Tokyo by his own mother. In the years that passed, the two lived peacefully while Kamui strengthened his innate telekinetic abilities. When his mother passes away in 1999, her dying wish prompts him to return to Tokyo to face his \"destiny.\"\n\nWhen Kamui reappears in the city, his attitude has taken a drastic turn, and he displays the growth of his powers through violent confrontations in the streets. Various opponents come after him asking if he is \"Kamui,\" but they seem to be demanding something far more significant than his name. These fighters represent two opposite factions—the Dragons of Heaven and the Dragons of Earth—who each wish to recruit him to their cause. Piecing together clues about the apocalyptic \"promised day,\" Kamui realizes that he holds the fate of the world in his hands. Depending on which group of Dragons he allies himself with, he can either choose to save the world—or end it.\n\n[Written by MAL Rewrite]",
            "id": 27,
            "endDate": "2003-03-24T00:00:00Z",
            "title": "X",
            "background": "X is written and illustrated by the four-person team of CLAMP. It is currently incomplete, but CLAMP has stated their intention to one day conclude the series if they can. It started serialization in Kadokawa Shoten's Monthly Asuka shoujo manga magazine in May 1992 and stopped serialization in March 2003. Events depicted in the manga were too similar for comfort to real-life disasters that occurred in Japan, which contributed to the series' halt. Chapters of X have been collected in eighteen and a \"half\" volumes, out of a total twenty-one volumes expected. X has been adapted into various anime that speculate about events that occurred before the manga started or after the point where the manga left off. The series was published in English by VIZ Media as 3-in-1 omnibus volume from November 8, 2011 to August 13, 2013.",
            "url": "\"https://myanimelist.net/manga/27/X\"",
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/2/267781l.jpg\"",
            "genres": [
                {
                    "id": "72C8E862-334F-4F00-B8EC-E1E4125BB7CD",
                    "genre": "Action"
                },
                {
                    "id": "4312867C-1359-494A-AC46-BADFD2E1D4CD",
                    "genre": "Drama"
                },
                {
                    "id": "B3E8D4B2-7EE4-49CD-8DB0-9897619B3F62",
                    "genre": "Fantasy"
                },
                {
                    "id": "AE80120B-6659-4C0E-AEB2-227EC25EC4AF",
                    "genre": "Supernatural"
                }
            ],
            "titleJapanese": "X"
        },
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "readingVolume": 1
    },
    {
        "volumesOwned": [
            1,
            5,
            9
        ],
        "id": "DD51CBF8-308D-4952-9C2D-FD35C8A34323",
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "manga": {
            "background": "xxxHOLiC was previously serialized in Young Magazine, but moved to in June 2010. The series was released in English by the now defunct Del Rey from April 27, 2004 to February 21, 2012. Kodansha Comics USA has republished the series in an omnibus edition from March 18, 2014 to September 8, 2015 the final two volumes were 2-in-1, while the previous were all 3-in-1. It was also published in Spanish by Norma Editorial from July 2004 to October 2011.",
            "id": 10,
            "volumes": 19,
            "sypnosis": "Living alone after his parents passed away, Kimihiro Watanuki is a high school student who can see otherworldly creatures that are attracted to him. His days are plagued by these nuisances, and he wishes to rid himself of this inconvenience. One fateful day, as Kimihiro is being chased by a horde of spirits, his feet bring him into a mysterious store to seek shelter. Here he meets Yuuko Ichihara, the mistress of this supposed store, who claims to be able to grant wishes. Yuuko offers to grant Kimihiro's, as long as he pays an appropriate price.\n\nThus begins Kimihiro's time working in her store to earn the payment necessary for his wish. In Yuuko's employ, he must become further involved with spirits and the supernatural before he can leave that world behind. How will he fare in the inexplicable encounters that await him?\n\n[Written by MAL Rewrite]",
            "titleEnglish": "xxxHOLiC",
            "title": "xxxHOLiC",
            "titleJapanese": "xxxHOLiC",
            "demographics": [
                {
                    "demographic": "Seinen",
                    "id": "CE425E7E-C7CD-42DB-ADE3-1AB9AD16386D"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/3/217533l.jpg\"",
            "score": 8.38,
            "chapters": 213,
            "endDate": "2011-02-09T00:00:00Z",
            "authors": [
                {
                    "lastName": "CLAMP",
                    "id": "425F1E1E-5163-48D6-8F39-C56BDE69ED99",
                    "role": "Story & Art",
                    "firstName": ""
                }
            ],
            "startDate": "2003-02-24T00:00:00Z",
            "genres": [
                {
                    "genre": "Comedy",
                    "id": "F974BCB6-B002-44A6-A224-90D1E50595A2"
                },
                {
                    "genre": "Drama",
                    "id": "4312867C-1359-494A-AC46-BADFD2E1D4CD"
                },
                {
                    "genre": "Mystery",
                    "id": "97C8609D-856C-419E-A4ED-E13A5C292663"
                },
                {
                    "genre": "Supernatural",
                    "id": "AE80120B-6659-4C0E-AEB2-227EC25EC4AF"
                }
            ],
            "status": "finished",
            "url": "\"https://myanimelist.net/manga/10/xxxHOLiC\"",
            "themes": []
        },
        "readingVolume": 19,
        "completeCollection": true
    },
    {
        "completeCollection": false,
        "volumesOwned": [
            1,
            2,
            3
        ],
        "id": "D43C39F7-D35C-4D10-A369-FD1CA2617E8A",
        "manga": {
            "sypnosis": "As the 20th century approaches its end, people all over the world are anxious that the world is changing. And probably not for the better.\n\nKenji Endo is a normal convenience store manager who's just trying to get by. But when he learns that one of his old friends going by the name \"Donkey\" has suddenly committed suicide, and that a new cult led by a figure known as \"Friend\" is becoming more notorious, Kenji starts to feel that something isn't right. With a few key clues left behind by his deceased friend, Kenji realizes that this cult is much more than he ever thought it would be—not only is this mysterious organization directly targeting him and his childhood friends, but the whole world also faces a grave danger that only the friends have the key to stop.\n\nKenji's simple life of barely making ends meet is flipped upside down when he reunites with his childhood friends, and together they must figure out the truth of how their past is connected to the cult, as the turn of the century could mean the possible end of the world.\n\n[Written by MAL Rewrite]",
            "authors": [
                {
                    "lastName": "Urasawa",
                    "id": "54BE174C-2FE9-42C8-A842-85D291A6AEDD",
                    "role": "Story & Art",
                    "firstName": "Naoki"
                }
            ],
            "titleJapanese": "20世紀少年",
            "id": 3,
            "url": "\"https://myanimelist.net/manga/3/20th_Century_Boys\"",
            "chapters": 249,
            "score": 8.95,
            "title": "20th Century Boys",
            "startDate": "1999-09-27T00:00:00Z",
            "endDate": "2006-04-24T00:00:00Z",
            "genres": [
                {
                    "genre": "Award Winning",
                    "id": "4C13067F-96FF-4F14-A1C0-B33215F24E0B"
                },
                {
                    "genre": "Drama",
                    "id": "4312867C-1359-494A-AC46-BADFD2E1D4CD"
                },
                {
                    "genre": "Mystery",
                    "id": "97C8609D-856C-419E-A4ED-E13A5C292663"
                },
                {
                    "genre": "Sci-Fi",
                    "id": "2DEDC015-82DA-4EF4-B983-F0F58C8F689E"
                }
            ],
            "titleEnglish": "20th Century Boys",
            "background": "20th Century Boys won the Kodansha Manga Award in the general category in 2001, an Excellence Prize at the Japan Media Arts Festival in 2002, and the Shogakukan Manga Award in the general category in 2003. The series' combined storyline won the Grand Prize at the 37th Japan Cartoonist Awards on May 9, 2008. VIZ Media published the series in English under the VIZ Signature imprint from February 17, 2009 to September 18, 2012. VIZ Media licensed the series in 2005; however, at Urasawa's request, it was rescheduled for release after Monster finished its English publication due to a change in art style over time. The series has also been published in Brazilian Portuguese by Panini Comics/Planet Manga since September 2012. The series was adapted into a trilogy of live-action films which released in Japan between August 30, 2008 and August 29, 2009.",
            "status": "finished",
            "themes": [
                {
                    "theme": "Psychological",
                    "id": "4394C99F-615B-494A-929E-356A342A95B8"
                },
                {
                    "theme": "Historical",
                    "id": "3CF0EDA7-5856-40F7-A0CF-EC676B4A842C"
                }
            ],
            "demographics": [
                {
                    "demographic": "Seinen",
                    "id": "CE425E7E-C7CD-42DB-ADE3-1AB9AD16386D"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/5/260006l.jpg\"",
            "volumes": 22
        },
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "readingVolume": 3
    },
    {
        "volumesOwned": [
            1
        ],
        "id": "84E57701-4CB8-473D-BAF9-AC48E8E684A2",
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "manga": {
            "themes": [
                {
                    "theme": "Psychological",
                    "id": "4394C99F-615B-494A-929E-356A342A95B8"
                },
                {
                    "theme": "Adult Cast",
                    "id": "840867E7-6C60-49CE-8C47-A99AA71A2113"
                }
            ],
            "volumes": 18,
            "id": 1,
            "titleEnglish": "Monster",
            "sypnosis": "Kenzou Tenma, a renowned Japanese neurosurgeon working in post-war Germany, faces a difficult choice: to operate on Johan Liebert, an orphan boy on the verge of death, or on the mayor of Düsseldorf. In the end, Tenma decides to gamble his reputation by saving Johan, effectively leaving the mayor for dead.\n\nAs a consequence of his actions, hospital director Heinemann strips Tenma of his position, and Heinemann's daughter Eva breaks off their engagement. Disgraced and shunned by his colleagues, Tenma loses all hope of a successful career—that is, until the mysterious killing of Heinemann gives him another chance.\n\nNine years later, Tenma is the head of the surgical department and close to becoming the director himself. Although all seems well for him at first, he soon becomes entangled in a chain of gruesome murders that have taken place throughout Germany. The culprit is a monster—the same one that Tenma saved on that fateful day nine years ago.\n\n[Written by MAL Rewrite]",
            "titleJapanese": "MONSTER",
            "title": "Monster",
            "demographics": [
                {
                    "demographic": "Seinen",
                    "id": "CE425E7E-C7CD-42DB-ADE3-1AB9AD16386D"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/3/258224l.jpg\"",
            "score": 9.15,
            "endDate": "2001-12-20T00:00:00Z",
            "startDate": "1994-12-05T00:00:00Z",
            "authors": [
                {
                    "lastName": "Urasawa",
                    "id": "54BE174C-2FE9-42C8-A842-85D291A6AEDD",
                    "role": "Story & Art",
                    "firstName": "Naoki"
                }
            ],
            "chapters": 162,
            "genres": [
                {
                    "genre": "Award Winning",
                    "id": "4C13067F-96FF-4F14-A1C0-B33215F24E0B"
                },
                {
                    "genre": "Drama",
                    "id": "4312867C-1359-494A-AC46-BADFD2E1D4CD"
                },
                {
                    "genre": "Mystery",
                    "id": "97C8609D-856C-419E-A4ED-E13A5C292663"
                }
            ],
            "status": "finished",
            "url": "\"https://myanimelist.net/manga/1/Monster\"",
            "background": "Monster won the Grand Prize at the 3rd annual Tezuka Osamu Cultural Prize in 1999, as well as the 46th Shogakukan Manga Award in the General category in 2000. The series was published in English by VIZ Media under the VIZ Signature imprint from February 21, 2006 to December 16, 2008, and again in 2-in-1 omnibuses (subtitled The Perfect Edition) from July 15, 2014 to July 19, 2016. The manga was also published in Brazilian Portuguese by Panini Comics/Planet Manga from June 2012 to April 2015, in Polish by Hanami from March 2014 to February 2017, in Spain by Planeta Cómic from June 16, 2009 to September 21, 2010, and in Argentina by LARP Editores."
        },
        "readingVolume": 1,
        "completeCollection": false
    },
    {
        "completeCollection": false,
        "volumesOwned": [
            1
        ],
        "id": "AB810594-60C6-43E8-90B4-69C3CDB2EFF6",
        "manga": {
            "sypnosis": "Gol D. Roger, a man referred to as the \"King of the Pirates,\" is set to be executed by the World Government. But just before his demise, he confirms the existence of a great treasure, One Piece, located somewhere within the vast ocean known as the Grand Line. Announcing that One Piece can be claimed by anyone worthy enough to reach it, the King of the Pirates is executed and the Great Age of Pirates begins.\n\nTwenty-two years later, a young man by the name of Monkey D. Luffy is ready to embark on his own adventure, searching for One Piece and striving to become the new King of the Pirates. Armed with just a straw hat, a small boat, and an elastic body, he sets out on a fantastic journey to gather his own crew and a worthy ship that will take them across the Grand Line to claim the greatest status on the high seas.\n\n[Written by MAL Rewrite]",
            "authors": [
                {
                    "lastName": "Oda",
                    "id": "25617399-543F-4220-9114-3A4181AF8D80",
                    "role": "Story & Art",
                    "firstName": "Eiichiro"
                }
            ],
            "titleJapanese": "ONE PIECE",
            "id": 13,
            "chapters": null,
            "url": "\"https://myanimelist.net/manga/13/One_Piece\"",
            "score": 9.22,
            "title": "One Piece",
            "startDate": "1997-07-22T00:00:00Z",
            "endDate": null,
            "background": "One Piece is the highest selling manga series of all time, with over 500 million copies in circulation as of 2022. Volume 67 of the series currently holds the record for highest first print run of any manga (including books) of all time in Japan, with 4.05 million in 2012. The series was a finalist for the Tezuka Osamu Cultural Prize three times in a row from 2000 to 2002. In 2012, it won the 41st Japan Cartoonists Association Award Grand Prize, alongside Kimuchi Yokoyama's Neko Darake. VIZ Media has published One Piece in English under the Shonen Jump imprint since January 2, 2003 and in 3-in-1 omnibus editions since December 1, 2009. VIZ Media released three boxed sets for the manga; the first including the first 23 volumes released on November 5, 2013, the second including volumes 24-46 released on November 4, 2014, and the third including volumes 47-70 released on October 4, 2016. The series has also been published in numerous amounts of languages worldwide including; Korean, Malay, Indonesian, Chinese, Thai, Vietnamese, German, French, Italian, Spanish, Portuguese, Swedish, Danish, Norwegian, Finnish, Polish, Turkish, and Russian.",
            "titleEnglish": "One Piece",
            "genres": [
                {
                    "genre": "Action",
                    "id": "72C8E862-334F-4F00-B8EC-E1E4125BB7CD"
                },
                {
                    "genre": "Adventure",
                    "id": "BE70E289-D414-46A9-8F15-928EAFBC5A32"
                },
                {
                    "genre": "Fantasy",
                    "id": "B3E8D4B2-7EE4-49CD-8DB0-9897619B3F62"
                }
            ],
            "status": "currently_publishing",
            "themes": [],
            "demographics": [
                {
                    "demographic": "Shounen",
                    "id": "5E05BBF1-A72E-4231-9487-71CFE508F9F9"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/2/253146l.jpg\"",
            "volumes": null
        },
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "readingVolume": 1
    },
    {
        "volumesOwned": [
            1
        ],
        "id": "4B10F4AD-76BD-4EF1-A096-632F87BCD15E",
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "manga": {
            "themes": [],
            "authors": [
                {
                    "firstName": "Tite",
                    "id": "76576CBC-75F3-456C-BD8C-CDB65D47E482",
                    "lastName": "Kubo",
                    "role": "Story & Art"
                }
            ],
            "volumes": 74,
            "demographics": [
                {
                    "demographic": "Shounen",
                    "id": "5E05BBF1-A72E-4231-9487-71CFE508F9F9"
                }
            ],
            "score": 7.84,
            "startDate": "2001-08-07T00:00:00Z",
            "titleEnglish": "Bleach",
            "chapters": 705,
            "status": "finished",
            "sypnosis": "For as long as he can remember, high school student Ichigo Kurosaki has been able to see the spirits of the dead, but that has not stopped him from leading an ordinary life. One day, Ichigo returns home to find an intruder in his room who introduces herself as Rukia Kuchiki, a Soul Reaper tasked with helping souls pass over. Suddenly, the two are jolted from their conversation when a Hollow—an evil spirit known for consuming souls—attacks. As Ichigo makes a brash attempt to stop the Hollow, Rukia steps in and shields him from a counterattack. Injured and unable to keep fighting, Rukia suggests a risky plan—transfer half of her Soul Reaper powers to Ichigo. He accepts and, to Rukia's surprise, ends up absorbing her powers entirely, allowing him to easily dispatch the Hollow.\n\nNow a Soul Reaper himself, Ichigo must take up Rukia's duties of exterminating Hollows and protecting spirits, both living and dead. Along with his friends Orihime Inoue and Yasutora Sado—who later discover spiritual abilities of their own—Ichigo soon learns that the consequences of becoming a Soul Reaper and dealing with the world of spirits are far greater than he ever imagined.\n\n[Written by MAL Rewrite]",
            "id": 12,
            "endDate": "2016-08-22T00:00:00Z",
            "title": "Bleach",
            "background": "Bleach has sold over 130 million copies worldwide as of 2022, making it one of the top 20 best selling manga series of all-time; North American sales have also been significant with 1.7 million copies sold in the region. In 2005, the series won the 50th Shogakukan Manga Award in the shounen demographic category. Many adaptations have also been made of the series, with a 2004 television anime series along with four feature length films, numerous video games, spin-off light novels, databooks, and even a musical. The series was published in English by VIZ Media under the Shonen Jump imprint from July 6, 2004 to October 2, 2018, and as omnibus volumes from June 7, 2011 to March 5, 2019; a hardcover collector's edition for volume one was released by VIZ Media on August 5, 2008, a box set of volumes 1-21 was released on September 16, 2008 as well as volumes 22-48 on July 7, 2015, and the final box set containing volumes 49-72 on November 6, 2018. It has also been published in Portuguese (Brazil) by Panini Comics and Planet Manga since July 2007, and in Spanish by Glénat/EDT since June 2006, publishing 51 volumes before the publisher went defunct, and later was republished by Panini Comics from February 2013 to November 2017. Bleach was adapted into a live-action movie on July 20, 2018.",
            "url": "\"https://myanimelist.net/manga/12/Bleach\"",
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/3/180031l.jpg\"",
            "titleJapanese": "BLEACH",
            "genres": [
                {
                    "id": "72C8E862-334F-4F00-B8EC-E1E4125BB7CD",
                    "genre": "Action"
                },
                {
                    "id": "BE70E289-D414-46A9-8F15-928EAFBC5A32",
                    "genre": "Adventure"
                },
                {
                    "id": "4C13067F-96FF-4F14-A1C0-B33215F24E0B",
                    "genre": "Award Winning"
                },
                {
                    "id": "B3E8D4B2-7EE4-49CD-8DB0-9897619B3F62",
                    "genre": "Fantasy"
                }
            ]
        },
        "readingVolume": 1,
        "completeCollection": false
    },
    {
        "volumesOwned": [
            1,
            2,
            3,
            7
        ],
        "id": "A52E5038-BFD1-496D-AD18-BE75D347CB96",
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "manga": {
            "themes": [
                {
                    "id": "C91B67F0-2B27-43F8-B399-13A974E14825",
                    "theme": "Harem"
                }
            ],
            "authors": [
                {
                    "firstName": "Ken",
                    "id": "7E307152-2634-46AE-9F73-8EEF01733A77",
                    "lastName": "Akamatsu",
                    "role": "Story & Art"
                }
            ],
            "volumes": 14,
            "demographics": [
                {
                    "demographic": "Shounen",
                    "id": "5E05BBF1-A72E-4231-9487-71CFE508F9F9"
                }
            ],
            "startDate": "1998-10-21T00:00:00Z",
            "score": 7.8,
            "titleEnglish": "Love Hina",
            "chapters": 120,
            "status": "finished",
            "sypnosis": "It is said that if a couple gets into the University of Tokyo together, they will live happily ever after. However, for Keitarou Urashima, UTokyo is a distant dream. After failing the entrance exams twice already, he decides to stay at his grandmother's inn in Tokyo in order to prepare for his third attempt. He is, therefore, surprised when he finds out that not only has his grandmother gone on a long vacation, but the inn has also become the Hinata House, an all-girls dormitory!\n\nUnfortunately for Keitarou, a series of misunderstandings during his first visit leave him with five untrusting tenants. But when Haruka Urashima, his aunt who works at the dorm, brings up that he is supposedly a UTokyo student, the girls' impressions of him quickly change, and they reluctantly allow him to stay. Feeling guilty about the lie, he slowly gets to know his new neighbors: the cute yet violent Naru Narusegawa, the cheeky and opportunistic Mitsune Konno, the soft-spoken Shinobu Maehara, the straight-laced Motoko Aoyama, and the mischievous Kaolla Su.\n\nThus continues the unpopular Keitarou's difficult journey to get into UTokyo, all for the chance to fulfill his childhood promise to the only girl who has ever shown any interest in him and maybe, just maybe, meet her again...\n\n[Written by MAL Rewrite]",
            "id": 16,
            "endDate": "2001-10-31T00:00:00Z",
            "title": "Love Hina",
            "background": "Love Hina won the 2001 Kodansha Manga Award for best shounen title. It was also chosen as Best Manga, USA Release at the 2002 and 2004 Anime Expo conventions, while the pop culture website ICv2 voted the title as the 2002 Anime Product of the Year. In 2003, it was among the top ten graphic novels on Nielsen BookScan's list, and one of the first graphic novels to ever appear in the general trade paperback list. The third volume of Love Hina's omnibus edition made the 2012 NY Times Manga bestseller list.",
            "url": "\"https://myanimelist.net/manga/16/Love_Hina\"",
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/1/259287l.jpg\"",
            "genres": [
                {
                    "id": "4C13067F-96FF-4F14-A1C0-B33215F24E0B",
                    "genre": "Award Winning"
                },
                {
                    "id": "F974BCB6-B002-44A6-A224-90D1E50595A2",
                    "genre": "Comedy"
                },
                {
                    "id": "9A13ADF1-52E5-4112-AE95-6F0DDEF4BC0D",
                    "genre": "Ecchi"
                },
                {
                    "id": "D8E1E0A9-DDC2-4520-BED7-745DD8DAD076",
                    "genre": "Romance"
                }
            ],
            "titleJapanese": "ラブひな"
        },
        "readingVolume": 7,
        "completeCollection": false
    },
    {
        "volumesOwned": [
            1
        ],
        "id": "B39B3051-D571-4715-92D8-1E865F84FDE4",
        "user": {
            "id": "7E0A58F4-4224-47AB-84D0-587F6550E6A5"
        },
        "manga": {
            "themes": [
                {
                    "theme": "School",
                    "id": "2ABA639D-480C-44FC-AE2C-FAA71C42DE7D"
                },
                {
                    "theme": "Martial Arts",
                    "id": "ADC7CBC8-36B9-4E52-924A-4272B7B2CB2C"
                },
                {
                    "theme": "Harem",
                    "id": "C91B67F0-2B27-43F8-B399-13A974E14825"
                }
            ],
            "id": 23,
            "volumes": 38,
            "sypnosis": "Soun Tendou runs the Tendou Martial Arts School accompanied by his three daughters: Akane, Nabiki, and Kasumi. One day, the sisters' lives are turned upside down when their father announces that he has promised one of them to be married to a fellow martial artist's son in hopes of carrying on the family legacy. In addition to their mixed reactions, when the fiancé arrives, the last thing the Tendou family expects is Ranma Saotome and his father, Genma.\n\nRanma has been training in China with his father until an unfortunate accident changed them both. Now, when water touches them, Ranma turns into a girl and Genma into a giant panda. Ranma ½ follows Ranma as he attempts to get along with his newly betrothed, the youngest of the Tendou sisters, Akane. As the two begin to attend the same school, they deal with fellow friends and rivals, all of whom have something to say about their engagement.\n\n[Written by MAL Rewrite]",
            "titleEnglish": "Ranma 1/2",
            "title": "Ranma ½",
            "titleJapanese": "らんま½",
            "demographics": [
                {
                    "demographic": "Shounen",
                    "id": "5E05BBF1-A72E-4231-9487-71CFE508F9F9"
                }
            ],
            "mainPicture": "\"https://cdn.myanimelist.net/images/manga/1/156534l.jpg\"",
            "score": 7.99,
            "endDate": "1996-02-21T00:00:00Z",
            "startDate": "1987-08-05T00:00:00Z",
            "chapters": 407,
            "authors": [
                {
                    "lastName": "Takahashi",
                    "id": "F5661B3B-17D6-43A9-A282-CE2AB74157DD",
                    "role": "Story & Art",
                    "firstName": "Rumiko"
                }
            ],
            "genres": [
                {
                    "genre": "Action",
                    "id": "72C8E862-334F-4F00-B8EC-E1E4125BB7CD"
                },
                {
                    "genre": "Comedy",
                    "id": "F974BCB6-B002-44A6-A224-90D1E50595A2"
                },
                {
                    "genre": "Ecchi",
                    "id": "9A13ADF1-52E5-4112-AE95-6F0DDEF4BC0D"
                },
                {
                    "genre": "Romance",
                    "id": "D8E1E0A9-DDC2-4520-BED7-745DD8DAD076"
                }
            ],
            "status": "finished",
            "url": "\"https://myanimelist.net/manga/23/Ranma_%C2%BD\"",
            "background": "Ranma ½ was published in English by VIZ Media from May 1993 to November 16, 2006. It was VIZ's longest running manga at the release of its final volume. It was republished in 2-in-1 omnibuses in the original right-to-left format by VIZ Media under the Shonen Sunday imprint from March 11, 2014 to March 14, 2017. The series was also partially published in Spanish in a special kanzenban edition (based on Japanese shinsouban) by EDT/Glénat España from December 2011 to June 2013, but the publisher went defunct. In June 2015, the license was picked up by Planeta Cómic."
        },
        "readingVolume": 1,
        "completeCollection": false
    }
]

